data/cfdb/validation/cylinder_re100/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Freestream U_inf = 1 m/s in +x. Cylinder D = 1 m, nu = 0.01 -> Re = 100.

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    cylinder
    {
        type            noSlip;
    }
    outer
    {
        type            freestreamVelocity;
        freestreamValue uniform (1 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
