data/cfdb/validation/cylinder_re100/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// O-grid around a circular cylinder, D=1 m, centre at origin.
// Cylinder radius r=0.5, outer (freestream) boundary radius R=20 (20D).
// 4 quadrant blocks: 120 cells circumferentially (30 per quadrant),
// 50 cells radially with geometric expansion (first cell ~0.0083 m,
// last/first ratio 250), 1 cell in z (2D, empty front/back).
// Total: 6000 cells. Demo-grade mesh; QoI tolerances in case.yaml reflect it.

scale   1;

vertices
(
    (0.5  0    0)      // 0  inner,   0 deg
    (0    0.5  0)      // 1  inner,  90 deg
    (-0.5 0    0)      // 2  inner, 180 deg
    (0   -0.5  0)      // 3  inner, 270 deg
    (20   0    0)      // 4  outer,   0 deg
    (0    20   0)      // 5  outer,  90 deg
    (-20  0    0)      // 6  outer, 180 deg
    (0   -20   0)      // 7  outer, 270 deg
    (0.5  0    0.1)    // 8
    (0    0.5  0.1)    // 9
    (-0.5 0    0.1)    // 10
    (0   -0.5  0.1)    // 11
    (20   0    0.1)    // 12
    (0    20   0.1)    // 13
    (-20  0    0.1)    // 14
    (0   -20   0.1)    // 15
);

blocks
(
    // hex: (inner_i outer_i outer_i+1 inner_i+1, +z counterparts)
    // dir1 = radial (50 cells, expand 250), dir2 = circumferential (30), dir3 = z
    hex (0 4 5 1 8 12 13 9)     (50 30 1) simpleGrading (250 1 1)
    hex (1 5 6 2 9 13 14 10)    (50 30 1) simpleGrading (250 1 1)
    hex (2 6 7 3 10 14 15 11)   (50 30 1) simpleGrading (250 1 1)
    hex (3 7 4 0 11 15 12 8)    (50 30 1) simpleGrading (250 1 1)
);

edges
(
    // cylinder surface, r = 0.5 (intermediate points at 45 deg)
    arc 0  1  ( 0.353553  0.353553 0)
    arc 1  2  (-0.353553  0.353553 0)
    arc 2  3  (-0.353553 -0.353553 0)
    arc 3  0  ( 0.353553 -0.353553 0)
    // outer boundary, r = 20
    arc 4  5  ( 14.14214  14.14214 0)
    arc 5  6  (-14.14214  14.14214 0)
    arc 6  7  (-14.14214 -14.14214 0)
    arc 7  4  ( 14.14214 -14.14214 0)
    // same arcs on the z = 0.1 plane
    arc 8  9  ( 0.353553  0.353553 0.1)
    arc 9  10 (-0.353553  0.353553 0.1)
    arc 10 11 (-0.353553 -0.353553 0.1)
    arc 11 8  ( 0.353553 -0.353553 0.1)
    arc 12 13 ( 14.14214  14.14214 0.1)
    arc 13 14 (-14.14214  14.14214 0.1)
    arc 14 15 (-14.14214 -14.14214 0.1)
    arc 15 12 ( 14.14214 -14.14214 0.1)
);

boundary
(
    cylinder
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 0 8 11)
        );
    }
    outer
    {
        type patch;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 4 0)
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
            (11 15 12 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
